tutorials/multiphase/interImmersedBoundaryFoam/damBreak/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue voidFraction 1
    volScalarFieldValue alpha1 0
);

regions
(
    sphereToCell
    {
        centre (0.05 0.05 0.01);
        radius 0.01;
        fieldValues
        (
            volScalarFieldValue voidFraction 0
        );
    }
    
    boxToCell
    {
        box (0 0 0) (0.03 0.1 0.05);
        fieldValues
        (
            volScalarFieldValue alpha1 1
        );
    }
);


// ************************************************************************* //
